app/controllers/accounts_controller.rb

SELECT  "accounts".* FROM "accounts" WHERE "accounts"."email" = ? LIMIT ?  [["email", "ecmerchant.contact@gmail.com"], ["LIMIT", 1]]
---
  def regist
    current_email = current_user.email

    if request.patch? then
      @account = Account.new
      data = params[:account]
      logger.debug('\n\nDebug')
      logger.debug(data)
      user = Account.find_by(email: current_email)