app/controllers/items_controller.rb

  def set

    if request.post? then
      res = params[:data]
      res = JSON.parse(res)
      ptable = res['price']
      ttable = res['title']
      ftable = res['fixed']
      keytable = res['keyword']

      current_email = current_user.email

      temp = Setting.find_by(email:current_email)
---
SELECT  "settings".* FROM "settings" WHERE "settings"."email" = ? LIMIT ?  [["email", "ecmerchant.contact@gmail.com"], ["LIMIT", 1]]